In [9]:
import pandas as pd
import numpy as np

## Numpy vs Pandas Creating array

In [14]:
a = np.array([1,2,3,4,5,6,7,8,9])

In [15]:
x = pd.Series([1,2,3,4,5,6])

In [16]:
x

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [17]:
a

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [20]:
serie1= pd.Series(["TX","OH", "LA", "NC"])

In [21]:
serie1

0    TX
1    OH
2    LA
3    NC
dtype: object

In [25]:
lists = [1,2,3,4,5,6]
series3 = pd.Series(lists)
series3

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [26]:
a = np.arange(1,10)

In [27]:
a

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [28]:
series3 = pd.Series(a)

In [29]:
series3

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [30]:
type(series3)

pandas.core.series.Series

In [31]:
series3.axes

[RangeIndex(start=0, stop=9, step=1)]

In [32]:
series3.dtype

dtype('int32')

In [33]:
series3.ndim

1

In [34]:
series3.shape

(9,)

In [43]:
series3.values ## We can see here all those kinds of values in series3!!

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [41]:
series3.head() ## first 5 values we can see!!

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [42]:
series3.tail() ## last 5 values we can see!!

4    5
5    6
6    7
7    8
8    9
dtype: int32

In [44]:
series3[3]

4

In [48]:
series3[3] = 100 ## we can also change index value!!

In [47]:
series3

0      1
1      2
2      3
3    100
4      5
5      6
6      7
7      8
8      9
dtype: int32

In [51]:
series4= pd.Series([10,20,30,40,50,60], index = (0,2,4,6,8,10)) ## We can also modify the index numbers

In [52]:
series4

0     10
2     20
4     30
6     40
8     50
10    60
dtype: int64

In [53]:
series4 = pd.Series([1,2,3,4,5,6], index = ("a","b","c","d","e","f"))

In [54]:
series4

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [55]:
series4["b"]

2

In [56]:
series4.c

3

In [58]:
series4.b

2

In [59]:
series4[2]

3

In [60]:
series4[3]

4

In [61]:
series4[1]

2

In [65]:
series5 = pd.Series((1,2,3,4,5,6), index = (10,20,30,40,50,60)) ## If you use tuple not using the regular index numberss 

series5[2]

KeyError: 2

In [66]:
series5[20]

2

In [67]:
series5.loc[20:50]

20    2
30    3
40    4
50    5
dtype: int64

In [68]:
series5.loc[20:90]

20    2
30    3
40    4
50    5
60    6
dtype: int64

In [71]:
series5.loc[10:70] ## It is not common useful method .loc

10    1
20    2
30    3
40    4
50    5
60    6
dtype: int64

In [72]:
series5

10    1
20    2
30    3
40    4
50    5
60    6
dtype: int64

In [73]:
series5.iloc[3]

4

In [106]:
ar =pd.DataFrame([0,1,2,3,4,5], columns= ["Index Numbers"])
ar

   Index Numbers
0              0
1              1
2              2
3              3
4              4
5              5

In [86]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [87]:
x = {'State' :["TX","OH", "LA"], 'License Plate':[1,2,3]}
define = pd.DataFrame(data=x)
define

  State  License Plate
0    TX              1
1    OH              2
2    LA              3

In [90]:
type(x)

dict

In [97]:
type(ar)

pandas.core.frame.DataFrame

In [98]:
ar.axes

[RangeIndex(start=0, stop=6, step=1), Index(['Index Numbers'], dtype='object')]

In [99]:
x.axes

AttributeError: 'dict' object has no attribute 'axes'

In [108]:
ar.shape

(6, 1)

In [111]:
a = np.random.randint(10,size=6)
b = np.random.randint(10,size=6)
c = np.random.randint(10,size=6)
data = pd.DataFrame({ "s1" : a ," s2" : b ," s3" : c})

In [125]:
data

    s2   s3
0    4    8
1    7    4
2    9    8
3    9    9
4    3    8
5    9    9

In [127]:
data.drop("s2",axis=0, inplace=True)

KeyError: "['s2'] not found in axis"

In [128]:
data

    s2   s3
0    4    8
1    7    4
2    9    8
3    9    9
4    3    8
5    9    9

## Pandas

**Pandas converts data into data consisting of rows and columns objects.**

***If the one of the objects is 1-d, it called pandas series. If the one of the objects is more than one dimention or we can say multi-dimention, it called pandas DataFrameWork objects.***

*It is working faster than regular python lists!!*

### Pandas Series Structure

In [129]:
student = ['Eren', 23, 'CS']

In [130]:
print(student)

['Eren', 23, 'CS']

In [131]:
student

['Eren', 23, 'CS']

In [133]:
type(student)

list

In [137]:
ps_student = pd.Series(student) ## Create pandas series
ps_student ## 1-d pandas series object!!

0    Eren
1      23
2      CS
dtype: object

In [140]:
type(ps_student) ## Series class automatically bringing index nums.

pandas.core.series.Series

In [148]:
student =  {
    'name' : 'Eren',
    'age' : 23,
    'discipline' : 'CS'
}

In [150]:
student ## Key value will return index in pandas dic.

{'name': 'Eren', 'age': 23, 'discipline': 'CS'}

In [151]:
type(student)

dict

In [152]:
ps_student = pd.Series(student)
ps_student

name          Eren
age             23
discipline      CS
dtype: object

In [153]:
type(ps_student)

pandas.core.series.Series

In [154]:
student = pd.Series(['Eren', 23, 'CS'])

In [155]:
student

0    Eren
1      23
2      CS
dtype: object

In [156]:
type(student)

pandas.core.series.Series

In [157]:
numbers = pd.Series([24, 37, 43])
numbers

0    24
1    37
2    43
dtype: int64

In [158]:
type(numbers)

pandas.core.series.Series

In [159]:
booleans= pd.Series ([True, False, True])

In [160]:
booleans

0     True
1    False
2     True
dtype: bool

In [161]:
type(booleans)

pandas.core.series.Series

In [162]:
student = pd.Series(data = ['Eren', 25, 'CS'], index = ['name' ,'age', 'department'])

In [163]:
student

name          Eren
age             25
department      CS
dtype: object

In [164]:
type(student)

pandas.core.series.Series

In [165]:
student.values

array(['Eren', 25, 'CS'], dtype=object)

In [166]:
student.index

Index(['name', 'age', 'department'], dtype='object')

In [167]:
student.iloc

In [168]:
student.loc

In [169]:
student.shape

(3,)

In [170]:
student.ndim

1

In [171]:
student.size

3

In [172]:
student.name

In [173]:
student.dtype

dtype('O')

In [174]:
student.name= 'Maradona'

In [175]:
student.name

'Maradona'

In [176]:
student.name = 'Pearl'

In [177]:
student.name

'Pearl'

In [178]:
student.name = 'Apple'
student.name

'Apple'

In [188]:
X = 'name' in student ## Boolean

In [189]:
X

True

In [183]:
Y = 'job' in student ## Booolean

In [184]:
Y

False

In [190]:
a = 'Dybala' in student.values

In [191]:
a

False

In [192]:
b = 'Eren' in student.values

In [193]:
b

True

In [197]:
numbers = pd.Series([1,2.4,2])

In [195]:
numbers

0    1.0
1    2.4
2    2.0
dtype: float64

In [201]:

numbers.mean()

1.8

In [204]:
numbers.product() ## Regular multiply not dot product.

4.8

In [205]:
numbers.sum()

5.4

### Access | Modify Elements

In [216]:
vehicles = pd.Series(data = ['Lucid', 'Luxury', 1100, 'EV'], index= ['brand', 'class', 'range', 'type'])

In [217]:
vehicles

brand     Lucid
class    Luxury
range      1100
type         EV
dtype: object

In [218]:
vehicles['brand']

'Lucid'

In [223]:
vehicles[['brand', 'range']]

brand    Lucid
range     1100
dtype: object

In [224]:
type(vehicles[['brand', 'range']])

pandas.core.series.Series

### Access Series Elements

In [225]:
student[0]

'Eren'

In [227]:
vehicles[0]

'Lucid'

In [230]:
vehicles[[1,2]]

class    Luxury
range      1100
dtype: object

In [232]:
vehicles[[1,2,3]]

class    Luxury
range      1100
type         EV
dtype: object

In [234]:
student[[1,2]]

age           25
department    CS
Name: Apple, dtype: object

In [235]:
student[[0,1]]

name    Eren
age       25
Name: Apple, dtype: object

In [237]:
vehicles[0:4]

brand     Lucid
class    Luxury
range      1100
type         EV
dtype: object

In [238]:
vehicles[-1]

'EV'

In [239]:
vehicles[-2:-1]

range    1100
dtype: object

In [243]:
student[:]

name          Eren
age             25
department      CS
Name: Apple, dtype: object

In [244]:
vehicles [:]

brand     Lucid
class    Luxury
range      1100
type         EV
dtype: object

In [245]:
vehicles[0:]

brand     Lucid
class    Luxury
range      1100
type         EV
dtype: object

In [248]:
vehicles[-2:] ## LAST 2 VALUES

range    1100
type       EV
dtype: object

In [ ]:
vehicles['brand':'type']  ## we can also bring data using string values.

brand     Lucid
class    Luxury
range      1100
type         EV
dtype: object

### .loc() = location methods, .iloc()index location methods

In [251]:
vehicles.loc['brand']

'Lucid'

In [252]:
vehicles.loc['class']

'Luxury'

In [258]:
vehicles.loc['range']## find with string

1100

In [259]:
vehicles.iloc[1]

'Luxury'

In [260]:
vehicles.iloc[2]

1100

In [261]:
vehicles.iloc[0]## find index number

'Lucid'

## Modify

In [262]:
vehicles

brand     Lucid
class    Luxury
range      1100
type         EV
dtype: object

In [263]:
vehicles['brand'] = 'model'
vehicles

brand     model
class    Luxury
range      1100
type         EV
dtype: object

In [264]:
vehicles['brand'] = 'Tesla'

In [265]:
vehicles

brand     Tesla
class    Luxury
range      1100
type         EV
dtype: object

In [268]:
vehicles.iloc[2] = 650

In [269]:
vehicles

brand     Tesla
class    Luxury
range       650
type         EV
dtype: object

In [270]:
## Pandas Series can mutable

In [273]:
student2= student.drop('name') ##There is no changing original data...

In [274]:
student

name          Eren
age             25
department      CS
Name: Apple, dtype: object

In [275]:
student2

age           25
department    CS
Name: Apple, dtype: object

In [276]:
student2.drop('age', inplace=True) ## Directly deleting with this...

In [277]:
student2

department    CS
Name: Apple, dtype: object

In [278]:
len(student)

3

In [285]:
len(student2)

1

In [283]:
dict(vehicles)

{'brand': 'Tesla', 'class': 'Luxury', 'range': 650, 'type': 'EV'}

In [293]:
x= pd.Series(['a','b','c'],[1,2,3])

In [294]:
sorted(x)

['a', 'b', 'c']

In [298]:
max(x)

'c'

In [299]:
min(x)

'a'

In [314]:
review_content = pd.read_csv('ReviewContent.csv', usecols=['Review ID'], squeeze= True, encoding='utf-8', engine= 'python')

C:\Users\Mustafa\AppData\Local\Temp\ipykernel_23720\3950170272.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  review_content = pd.read_csv('ReviewContent.csv', usecols=['Review ID'], squeeze= True, encoding='utf-8', engine= 'python')

***usecols = which columns are you wanna use it.***

***squeeze= Change data with dataFrame or series in this example data looks series because*** **squeeze = False**.
***If we write it down squeeze = True it will bring data as a series...***

In [315]:
review_content

0       4055629
1      25329416
2      21705849
3      41133812
4       7465026
         ...
995    44498863
996    30544438
997    46642535
998    21403195
999    38944752
Name: Review ID, Length: 1000, dtype: int64

In [316]:
type(review_content)

pandas.core.series.Series

In [322]:
review_content.head(10)

0     4055629
1    25329416
2    21705849
3    41133812
4     7465026
5    11372151
6    20417380
7    10787310
8    37085487
9    15542291
Name: Review ID, dtype: int64

In [325]:
review_content

0       4055629
1      25329416
2      21705849
3      41133812
4       7465026
         ...
995    44498863
996    30544438
997    46642535
998    21403195
999    38944752
Name: Review ID, Length: 1000, dtype: int64

In [323]:
review_content.tail(10)

990    32907620
991    35585745
992    13423090
993    27392171
994    28605533
995    44498863
996    30544438
997    46642535
998    21403195
999    38944752
Name: Review ID, dtype: int64

In [324]:
review_content

0       4055629
1      25329416
2      21705849
3      41133812
4       7465026
         ...
995    44498863
996    30544438
997    46642535
998    21403195
999    38944752
Name: Review ID, Length: 1000, dtype: int64

In [326]:
review_content.head(10)

0     4055629
1    25329416
2    21705849
3    41133812
4     7465026
5    11372151
6    20417380
7    10787310
8    37085487
9    15542291
Name: Review ID, dtype: int64

In [338]:
review_content.sort_index(ascending=False, inplace=True)

In [339]:
review_content

999    38944752
998    21403195
997    46642535
996    30544438
995    44498863
         ...
4       7465026
3      41133812
2      21705849
1      25329416
0       4055629
Name: Review ID, Length: 1000, dtype: int64

In [329]:
review_content.sort_values().head(10)

516     41756
535     67176
766     97586
741    123549
560    151811
847    205942
188    432284
65     443786
954    499085
453    503200
Name: Review ID, dtype: int64

In [330]:
review_content.head(10) ## there is no chaning in main dataset.

0     4055629
1    25329416
2    21705849
3    41133812
4     7465026
5    11372151
6    20417380
7    10787310
8    37085487
9    15542291
Name: Review ID, dtype: int64

In [334]:
review_content.sort_values(inplace= True, ascending=False) ## Now it is permanently saving here. And also we can add ascendin or descending in here.... now it will come bigger to smaller nums.

In [342]:
review_content.head()

999    38944752
998    21403195
997    46642535
996    30544438
995    44498863
Name: Review ID, dtype: int64

In [343]:
review_content.sort_values(inplace=True)

In [344]:
review_content.head(10)

516     41756
535     67176
766     97586
741    123549
560    151811
847    205942
188    432284
65     443786
954    499085
453    503200
Name: Review ID, dtype: int64

In [345]:
review_content.sort_index(inplace=True)

In [346]:
review_content.head(10)

0     4055629
1    25329416
2    21705849
3    41133812
4     7465026
5    11372151
6    20417380
7    10787310
8    37085487
9    15542291
Name: Review ID, dtype: int64

In [348]:
review_content[4] ## in this way we can reach elements///

7465026

In [350]:
review_content

0       4055629
1      25329416
2      21705849
3      41133812
4       7465026
         ...
995    44498863
996    30544438
997    46642535
998    21403195
999    38944752
Name: Review ID, Length: 1000, dtype: int64

In [354]:
print(review_content.get(1004, default='Unknown'))

Unknown

In [352]:
review_content

0       4055629
1      25329416
2      21705849
3      41133812
4       7465026
         ...
995    44498863
996    30544438
997    46642535
998    21403195
999    38944752
Name: Review ID, Length: 1000, dtype: int64

In [355]:
print(type(review_content.get(4)))
print(type(review_content[4]))

<class 'numpy.int64'>
<class 'numpy.int64'>

In [356]:
review_content.get([0,4])

0    4055629
4    7465026
Name: Review ID, dtype: int64

In [357]:
type(review_content.get([0,4]))

pandas.core.series.Series

## Data Frames

In [4]:
students = [
    {
        'name': 'eren',
        'age' : 32,
        'gender': 'male'
    },
    {
        'name': 'Ram',
        'age' : 23,
        'gender': 'male'
    },
    {
        'name': 'Ashley',
        'age' : 65,
        'gender': 'female'
    } ]

In [5]:
students

[{'name': 'eren', 'age': 32, 'gender': 'male'},
 {'name': 'Ram', 'age': 23, 'gender': 'male'},
 {'name': 'Ashley', 'age': 65, 'gender': 'female'}]

In [6]:
type(students)

list

In [10]:
df_students= pd.DataFrame(students)

In [11]:
df_students

     name  age  gender
0    eren   32    male
1     Ram   23    male
2  Ashley   65  female

In [12]:
type(df_students)

pandas.core.frame.DataFrame

In [13]:
instructors = {
    'names': ['Carl','Zack', 'Cho'],
    'ages':[41,23,45],
    'genders':['m','m','m']
}

In [14]:
instructors

{'names': ['Carl', 'Zack', 'Cho'],
 'ages': [41, 23, 45],
 'genders': ['m', 'm', 'm']}

In [15]:
type(instructors)

dict

In [16]:
df_instructors = pd.DataFrame(instructors)

In [18]:
df_instructors

  names  ages genders
0  Carl    41       m
1  Zack    23       m
2   Cho    45       m

In [19]:
type(df_instructors)

pandas.core.frame.DataFrame

In [20]:
list_oflist=[
    ['Duran','Kevin','Love','Derrick','Rose'],
    [32 , 31, 21, 32, 53]]

In [21]:
list_oflist

[['Duran', 'Kevin', 'Love', 'Derrick', 'Rose'], [32, 31, 21, 32, 53]]

In [22]:
df_list_oflist = pd.DataFrame(list_oflist)

In [23]:
df_list_oflist

       0      1     2        3     4
0  Duran  Kevin  Love  Derrick  Rose
1     32     31    21       32    53

In [24]:
type(df_list_oflist)

pandas.core.frame.DataFrame

In [25]:
names = ['Duran', 'Kevin', 'Love', 'Derrick', 'Rose']

In [26]:
type(names)

list

In [27]:
df_name = pd.DataFrame(names)

In [28]:
df_name

         0
0    Duran
1    Kevin
2     Love
3  Derrick
4     Rose

In [29]:
type(df_name)

pandas.core.frame.DataFrame

In [30]:
df_name.ndim

2

In [45]:
students = {'halen': pd.Series(data= [25, 'F', 'CS',2], index = ['age','gender','discipline','s']),
           'Dimitri': pd.Series(data= [24, 'M', 'CS','a'], index = ['age','gender','discipline','a'])
           }

In [46]:
students

{'halen': age           25
 gender         F
 discipline    CS
 s              2
 dtype: object,
 'Dimitri': age           24
 gender         M
 discipline    CS
 a              a
 dtype: object}

In [47]:
type(students)

dict

In [48]:
df_students = pd.DataFrame(students)

In [49]:
df_students

           halen Dimitri
a            NaN       a
age           25      24
discipline    CS      CS
gender         F       M
s              2     NaN

In [50]:
type(df_students)

pandas.core.frame.DataFrame

In [52]:
students = {'Halen': pd.Series(data= [25, 'F', 'CS',2], index = ['age','gender','discipline','a']),
           'Dimitri': pd.Series(data= [24, 'M', 'CS',3], index = ['age','gender','discipline','a']),
            'Zack': pd.Series(data= [24, 'M', 'CS',4], index = ['age','gender','discipline','a'])
           }

In [53]:
df_students= pd.DataFrame(students)

In [54]:
df_students

           Halen Dimitri Zack
age           25      24   24
gender         F       M    M
discipline    CS      CS   CS
a              2       3    4

In [55]:
type(df_students)

pandas.core.frame.DataFrame

In [61]:
df_students2 = pd.DataFrame (students, columns=['Halen' ,'Dimitri'])

In [62]:
df_students2

           Halen Dimitri
age           25      24
gender         F       M
discipline    CS      CS
a              2       3

In [65]:
df_students3 = pd.DataFrame(students, index = ['age', 'gender'])

In [66]:
df_students3

       Halen Dimitri Zack
age       25      24   24
gender     F       M    M

In [67]:
df_students = pd.DataFrame(students, columns = ['Halen', 'Dimitri'], index = ['age','gender'])

In [68]:
df_students

       Halen Dimitri
age       25      24
gender     F       M

In [69]:
df_students ['Halen']

age       25
gender     F
Name: Halen, dtype: object

In [70]:
type(df_students)

pandas.core.frame.DataFrame

In [71]:
df_students[['Halen']]

       Halen
age       25
gender     F

In [72]:
type(df_students)

pandas.core.frame.DataFrame

In [73]:
df_students

       Halen Dimitri
age       25      24
gender     F       M

In [74]:
df_students[['Halen', 'Dimitri']]

       Halen Dimitri
age       25      24
gender     F       M

In [75]:
type(df_students)

pandas.core.frame.DataFrame

### .loc,.iloc

In [77]:
students = {'Halen': pd.Series(data= [25, 'F', 'CS',2], index = ['age','gender','discipline','a']),
           'Dimitri': pd.Series(data= [24, 'M', 'CS',3], index = ['age','gender','discipline','a']),
            'Zack': pd.Series(data= [24, 'M', 'CS',4], index = ['age','gender','discipline','a'])
           }

df_students= pd.DataFrame(students)
df_students

           Halen Dimitri Zack
age           25      24   24
gender         F       M    M
discipline    CS      CS   CS
a              2       3    4

In [79]:
df_students.loc['age']

Halen      25
Dimitri    24
Zack       24
Name: age, dtype: object

In [80]:
type(df_students.loc['age'])

pandas.core.series.Series

In [82]:
df_students.loc[['age','gender']]

       Halen Dimitri Zack
age       25      24   24
gender     F       M    M

In [83]:
type(df_students)

pandas.core.frame.DataFrame

### DF [COL],[ROW]

In [85]:
df_students

           Halen Dimitri Zack
age           25      24   24
gender         F       M    M
discipline    CS      CS   CS
a              2       3    4

In [89]:
df_students['Halen']['age']

25

In [90]:
df_students['Dimitri']['discipline']

'CS'

In [91]:
df_students['Zack']['gender']

'M'

In [94]:
df_students['Zack'][1]

'M'

### Add new columns and cells infos

In [95]:
df_students['Mario'] = [18, 'M', 'CE', 5]

In [96]:
df_students

           Halen Dimitri Zack Mario
age           25      24   24    18
gender         F       M    M     M
discipline    CS      CS   CS    CE
a              2       3    4     5

In [98]:
df_students['Mario and Zack'] = df_students['Zack'] +  df_students['Mario']

In [99]:
df_students

           Halen Dimitri Zack Mario Mario and Zack
age           25      24   24    18             42
gender         F       M    M     M             MM
discipline    CS      CS   CS    CE           CSCE
a              2       3    4     5              9

In [103]:
new_row = pd.DataFrame({'Halen':'Sad','Dimitri': 'Happy', 'Zack':'Excited'}, index = ['emotion'])

In [104]:
df_students =  df_students.append(new_row)

C:\Users\Mustafa\AppData\Local\Temp\ipykernel_31588\2105326438.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_students =  df_students.append(new_row)

In [105]:
df_students

           Halen Dimitri     Zack Mario Mario and Zack
age           25      24       24    18             42
gender         F       M        M     M             MM
discipline    CS      CS       CS    CE           CSCE
a              2       3        4     5              9
emotion      Sad   Happy  Dilemma   NaN            NaN
emotion      Sad   Happy  Excited   NaN            NaN

### pop >col , drop > col- row(axis)

In [106]:
df_students

           Halen Dimitri     Zack Mario Mario and Zack
age           25      24       24    18             42
gender         F       M        M     M             MM
discipline    CS      CS       CS    CE           CSCE
a              2       3        4     5              9
emotion      Sad   Happy  Dilemma   NaN            NaN
emotion      Sad   Happy  Excited   NaN            NaN

In [107]:
df_students.pop('Halen') ## Delete column

age            25
gender          F
discipline     CS
a               2
emotion       Sad
emotion       Sad
Name: Halen, dtype: object

In [108]:
df_students

           Dimitri     Zack Mario Mario and Zack
age             24       24    18             42
gender           M        M     M             MM
discipline      CS       CS    CE           CSCE
a                3        4     5              9
emotion      Happy  Dilemma   NaN            NaN
emotion      Happy  Excited   NaN            NaN

In [114]:
df_students = df_students.drop(['Zack','Mario and Zack'], axis=1) ## Delete column axis =1

In [115]:
df_students

           Mario
age           18
gender         M
discipline    CE
a              5
emotion      NaN
emotion      NaN

In [ ]:
df_students = df_students.drop(['discipline','a'], axis =0) ## we can delete entire  axis row

In [120]:
df_students

       Mario
age       18
gender     M

In [124]:
students = {'Halen': pd.Series(data= [25, 'Daymond', 'CS',2], index = ['age','surname','discipline','a']),
           'Dimitri': pd.Series(data= [24, 'M', 'CS',30], index = ['age','gender','discipline','d']),
            'Zack': pd.Series(data= [24, 'M', 'CS',4], index = ['age','gender','discipline','a'])
           }

df_students= pd.DataFrame(students)
df_students

              Halen Dimitri Zack
a                 2     NaN    4
age              25      24   24
d               NaN      30  NaN
discipline       CS      CS   CS
gender          NaN       M    M
surname     Daymond     NaN  NaN

In [127]:
x = df_students.isnull()

In [128]:
x

            Halen  Dimitri   Zack
a           False     True  False
age         False    False  False
d            True    False   True
discipline  False    False  False
gender       True    False  False
surname     False     True   True

In [129]:
type(x)

pandas.core.frame.DataFrame

In [130]:
y = df_students.isnull().sum() ## Count how many non value we have in each columns

In [131]:
y

Halen      2
Dimitri    2
Zack       2
dtype: int64

In [132]:
type(y)

pandas.core.series.Series

In [136]:
z = df_students.isnull().sum().sum() ## Total number of nan

In [137]:
z

6

In [138]:
type(z)

numpy.int64

In [139]:
x = df_students.notnull()

In [140]:
x

            Halen  Dimitri   Zack
a            True    False   True
age          True     True   True
d           False     True  False
discipline   True     True   True
gender      False     True   True
surname      True    False  False

In [141]:
y = df_students.notnull().sum()

In [142]:
y

Halen      4
Dimitri    4
Zack       4
dtype: int64

In [143]:
z = df_students.notnull().sum().sum()

In [144]:
z

12

In [145]:
x = df_students.count()

In [146]:
x

Halen      4
Dimitri    4
Zack       4
dtype: int64

In [147]:
y = df_students.count().sum()

In [148]:
y

12

### How to clean data from nons

In [153]:
df_students

              Halen Dimitri Zack
a                 2     NaN    4
age              25      24   24
d               NaN      30  NaN
discipline       CS      CS   CS
gender          NaN       M    M
surname     Daymond     NaN  NaN

#### dropna()

In [156]:
x = df_students.dropna() ## Which rows have non value, it will remove entire row.

In [157]:
x

           Halen Dimitri Zack
age           25      24   24
discipline    CS      CS   CS

In [159]:
df_students ## never change original data sets.

              Halen Dimitri Zack
a                 2     NaN    4
age              25      24   24
d               NaN      30  NaN
discipline       CS      CS   CS
gender          NaN       M    M
surname     Daymond     NaN  NaN

In [165]:
y = df_students.dropna(how="all") # If all data is nan then delete entire row. otherwise does not work

In [166]:
y

              Halen Dimitri Zack
a                 2     NaN    4
age              25      24   24
d               NaN      30  NaN
discipline       CS      CS   CS
gender          NaN       M    M
surname     Daymond     NaN  NaN

In [173]:
y = df_students.dropna(thresh=1)  ## thresh=1 parameters if row has 1 non, no need to give any reaction. but we write tresh =2, it will delete which rows have 2 non value

In [174]:
y

              Halen Dimitri Zack
a                 2     NaN    4
age              25      24   24
d               NaN      30  NaN
discipline       CS      CS   CS
gender          NaN       M    M
surname     Daymond     NaN  NaN

In [182]:
y = df_students.dropna(axis=1) ## which columns have non, delete all non columns.

In [180]:
y

Empty DataFrame
Columns: []
Index: [a, age, d, discipline, gender, surname]

In [190]:
students = {'Halen': pd.Series(data= [25, 'Daymond', 'CS',2], index = ['age','surname','discipline','a']),
           'Dimitri': pd.Series(data= [24, 'M', 'CS',30], index = ['age','gender','discipline','d']),
            'Zack': pd.Series(data= [24, 'M', 'CS',4], index = ['age','gender','discipline','a'])
           }

df_students= pd.DataFrame(students)
df_students

              Halen Dimitri Zack
a                 2     NaN    4
age              25      24   24
d               NaN      30  NaN
discipline       CS      CS   CS
gender          NaN       M    M
surname     Daymond     NaN  NaN

In [191]:
x = df_students.fillna(method = 'ffill', axis=0) ## fillna if the nan value seee in the rows, copy before columns value. ffill means forward fill. if you wantyou can also put backfill value.

In [192]:
x

              Halen Dimitri Zack
a                 2     NaN    4
age              25      24   24
d                25      30   24
discipline       CS      CS   CS
gender           CS       M    M
surname     Daymond       M    M

In [195]:
x = df_students.fillna(method = 'ffill', axis=1)## it will change with columns

In [196]:
x

              Halen  Dimitri     Zack
a                 2        2        4
age              25       24       24
d               NaN       30       30
discipline       CS       CS       CS
gender          NaN        M        M
surname     Daymond  Daymond  Daymond

In [199]:
review = pd.read_csv('ReviewContent.csv')

In [200]:
review

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,Amsterdam,North Holland,The Netherlands,Private room,80,10
2,21705849,2014-11-27,I stayed for 4night.She gave us a lot of snuck...,"PRIVATE Room in Spacious, Quiet Apt",Harlem,New York City,New York,United States,Private room,57,268
3,41133812,2012-05-08,The apartment was situated on the first floor ...,Bonito estudio en pleno centro,Universidad,Madrid,Comunidad de Madrid,Spain,Entire home/apt,38,274
4,7465026,2013-08-16,"Even though it was only for one night, we had ...",Acropolis Apartment brand new,,Athens,Attica,Greece,Entire home/apt,62,281
...,...,...,...,...,...,...,...,...,...,...,...
995,44498863,2012-08-30,I loved staying here during my time in Paris. ...,A typical parisian flat,Buttes-Montmartre,Paris,le-de-France,France,Private room,35,329
996,30544438,2013-02-28,Highly recommend this as a place to stay if yo...,The Venice Roost on Abbot Kinney,Venice,Los Angeles,California,United States,Entire home/apt,191,309
997,46642535,2014-08-30,John was a great host. I came in on a red eye...,Top Floor Renovated 1 BR / 1BA,West Roxbury,Boston,Massachusetts,United States,Entire home/apt,95,10
998,21403195,2014-12-26,Very good experiance had a comfortable stay. V...,NR LGA/JFK & City Studio W/Bathroom,Jackson Heights,New York City,New York,United States,Private room,75,357
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,New York City,New York,United States,Private room,110,329

In [201]:
type(review)

pandas.core.frame.DataFrame

In [202]:
review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Review ID          1000 non-null   int64
 1   Review Date        1000 non-null   object
 2   Review Content     999 non-null    object
 3   Listing Title      1000 non-null   object
 4   Neighbourhood      1000 non-null   object
 5   City               1000 non-null   object
 6   State              1000 non-null   object
 7   Country            1000 non-null   object
 8   Room Type          1000 non-null   object
 9   Room Price         1000 non-null   int64
 10  Room Availability  1000 non-null   int64
dtypes: int64(3), object(8)
memory usage: 86.1+ KB

In [203]:
review.head()

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,Amsterdam,North Holland,The Netherlands,Private room,80,10
2,21705849,2014-11-27,I stayed for 4night.She gave us a lot of snuck...,"PRIVATE Room in Spacious, Quiet Apt",Harlem,New York City,New York,United States,Private room,57,268
3,41133812,2012-05-08,The apartment was situated on the first floor ...,Bonito estudio en pleno centro,Universidad,Madrid,Comunidad de Madrid,Spain,Entire home/apt,38,274
4,7465026,2013-08-16,"Even though it was only for one night, we had ...",Acropolis Apartment brand new,,Athens,Attica,Greece,Entire home/apt,62,281

In [204]:
review.tail()

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
995,44498863,2012-08-30,I loved staying here during my time in Paris. ...,A typical parisian flat,Buttes-Montmartre,Paris,le-de-France,France,Private room,35,329
996,30544438,2013-02-28,Highly recommend this as a place to stay if yo...,The Venice Roost on Abbot Kinney,Venice,Los Angeles,California,United States,Entire home/apt,191,309
997,46642535,2014-08-30,John was a great host. I came in on a red eye...,Top Floor Renovated 1 BR / 1BA,West Roxbury,Boston,Massachusetts,United States,Entire home/apt,95,10
998,21403195,2014-12-26,Very good experiance had a comfortable stay. V...,NR LGA/JFK & City Studio W/Bathroom,Jackson Heights,New York City,New York,United States,Private room,75,357
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,New York City,New York,United States,Private room,110,329

In [207]:
review.dtypes

Review ID             int64
Review Date          object
Review Content       object
Listing Title        object
Neighbourhood        object
City                 object
State                object
Country              object
Room Type            object
Room Price            int64
Room Availability     int64
dtype: object

In [208]:
review.ndim

2

In [209]:
review.columns

Index(['Review ID', 'Review Date', 'Review Content', 'Listing Title',
       'Neighbourhood', 'City', 'State', 'Country', 'Room Type', 'Room Price',
       'Room Availability'],
      dtype='object')

In [211]:
review.memory_usage()

Index                 128
Review ID            8000
Review Date          8000
Review Content       8000
Listing Title        8000
Neighbourhood        8000
City                 8000
State                8000
Country              8000
Room Type            8000
Room Price           8000
Room Availability    8000
dtype: int64

In [212]:
review.describe()

          Review ID   Room Price  Room Availability
count  1.000000e+03  1000.000000        1000.000000
mean   2.375850e+07   118.048000         253.651000
std    1.320179e+07   101.410975         109.209404
min    4.175600e+04    16.000000           0.000000
25%    1.212871e+07    60.000000         193.750000
50%    2.439248e+07    95.000000         300.000000
75%    3.456738e+07   140.000000         335.000000
max    5.310338e+07  1500.000000         365.000000

In [213]:
review['Room Price'].sum()

118048

In [214]:
review.sum()

C:\Users\Mustafa\AppData\Local\Temp\ipykernel_31588\3697626260.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  review.sum()

Review ID                                                  23758497050
Review Date          2012-10-062013-11-032014-11-272012-05-082013-0...
Listing Title        Nottinghill Portobello  Artist FlatQuiet Pink ...
Neighbourhood        Kensington and ChelseaDe Pijp - RivierenbuurtH...
City                 LondonAmsterdamNew York CityMadridAthensPortla...
State                EnglandNorth HollandNew YorkComunidad de Madri...
Country              United KingdomThe NetherlandsUnited StatesSpai...
Room Type            Entire home/aptPrivate roomPrivate roomEntire ...
Room Price                                                      118048
Room Availability                                               253651
dtype: object

In [215]:
review["Room Availability"]

0      338
1       10
2      268
3      274
4      281
      ...
995    329
996    309
997     10
998    357
999    329
Name: Room Availability, Length: 1000, dtype: int64

In [220]:
review["Room Availability"].add(10) ## It will increase each data value +10

0      348
1       20
2      278
3      284
4      291
      ...
995    339
996    319
997     20
998    367
999    339
Name: Room Availability, Length: 1000, dtype: int64

In [221]:
review["Room Availability"] + 10 # We can calculate series value with integer nums.

0      348
1       20
2      278
3      284
4      291
      ...
995    339
996    319
997     20
998    367
999    339
Name: Room Availability, Length: 1000, dtype: int64

In [223]:
review["City"].value_counts()

New York City    135
London           104
Paris            101
Los Angeles       68
Barcelona         61
San Francisco     59
Berlin            56
Amsterdam         45
Sydney            33
Madrid            28
Portland          28
Montreal          27
Brussels          23
Toronto           23
Seattle           23
New Orleans       22
Austin            22
Chicago           21
Venice            21
Boston            21
Washington        18
Vienna            14
Melbourne         14
Nashville         13
Athens            10
Antwerp            5
Oakland            5
Name: City, dtype: int64

In [226]:
review['Room Type'].value_counts()

Entire home/apt    648
Private room       340
Shared room         12
Name: Room Type, dtype: int64

In [230]:
review["Room Price"].value_counts().head()

80     32
120    31
75     27
95     27
55     26
Name: Room Price, dtype: int64

In [233]:
review["Room Price"].sort_values(ascending= False) ## Ordered by room price

799    1500
489     800
518     775
613     725
555     650
       ...
576      22
452      19
306      19
718      16
740      16
Name: Room Price, Length: 1000, dtype: int64

In [234]:
review["City"].sort_values()

409     Amsterdam
912     Amsterdam
770     Amsterdam
168     Amsterdam
782     Amsterdam
          ...
839    Washington
139    Washington
128    Washington
589    Washington
437    Washington
Name: City, Length: 1000, dtype: object

In [235]:
review["City"].sort_values(ascending=False)

235    Washington
450    Washington
139    Washington
921    Washington
697    Washington
          ...
970     Amsterdam
58      Amsterdam
831     Amsterdam
530     Amsterdam
722     Amsterdam
Name: City, Length: 1000, dtype: object

In [237]:
review.sort_values('Room Price', ascending= False)

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
799,5239947,2013-01-15,The only issue that we had was that the elevat...,Amazing hillside 4 bdrm 4k sq ft,Monterey Park,Los Angeles,California,United States,Entire home/apt,1500,365
489,25836446,2012-03-05,The reservation was canceled 79 days before ar...,Mansion In The Sky-Duplex Penthouse,Loop,Chicago,Illinois,United States,Entire home/apt,800,359
518,29952932,2013-06-15,Very beautiful apartment in a great location.,Stunning Townhouse - West Village,West Village,New York City,New York,United States,Entire home/apt,775,316
613,41553198,2014-12-10,Brian and his team were great! We had a group ...,Chic Massive 4 Bed Room Duplex!,Lower East Side,New York City,New York,United States,Entire home/apt,725,316
555,8381199,2014-10-25,This was my first Airbnb experience. We were ...,SPACIOUS & LUXURIOUS 2-LEVEL CONDO,Haight Ashbury,San Francisco,California,United States,Entire home/apt,650,327
...,...,...,...,...,...,...,...,...,...,...,...
576,7795982,2013-05-10,We had a great time in Berlin! Jamie is a very...,Charming 20m room Prenzlauer Berg,Prenzlauer Berg Nord,Berlin,Berlin,Germany,Private room,22,344
452,11937812,2012-05-28,I just had a wonderfull time in there: good co...,"Camp Nou, Sants Staci & University",la Maternitat i Sant Ramon,Barcelona,Catalonia,Spain,Private room,19,333
306,44838729,2012-06-03,It was easy to find and the room was clean. Ve...,COSY ROOM-center-5 mn RAMBLAS,el Poble Sec,Barcelona,Catalonia,Spain,Private room,19,336
718,47355526,2012-08-05,Manuel was very sweet and helpful! Very nice a...,"Bernabu, Twin Bedroom, Breakfast",Berruguete,Madrid,Comunidad de Madrid,Spain,Private room,16,112
740,37117583,2012-04-20,Alex is a very considerate airbnb host. He mad...,Good Vibes in the heart of BXL !,Ixelles,Brussels,Brussels,Belgium,Shared room,16,326

In [238]:
review

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,Amsterdam,North Holland,The Netherlands,Private room,80,10
2,21705849,2014-11-27,I stayed for 4night.She gave us a lot of snuck...,"PRIVATE Room in Spacious, Quiet Apt",Harlem,New York City,New York,United States,Private room,57,268
3,41133812,2012-05-08,The apartment was situated on the first floor ...,Bonito estudio en pleno centro,Universidad,Madrid,Comunidad de Madrid,Spain,Entire home/apt,38,274
4,7465026,2013-08-16,"Even though it was only for one night, we had ...",Acropolis Apartment brand new,,Athens,Attica,Greece,Entire home/apt,62,281
...,...,...,...,...,...,...,...,...,...,...,...
995,44498863,2012-08-30,I loved staying here during my time in Paris. ...,A typical parisian flat,Buttes-Montmartre,Paris,le-de-France,France,Private room,35,329
996,30544438,2013-02-28,Highly recommend this as a place to stay if yo...,The Venice Roost on Abbot Kinney,Venice,Los Angeles,California,United States,Entire home/apt,191,309
997,46642535,2014-08-30,John was a great host. I came in on a red eye...,Top Floor Renovated 1 BR / 1BA,West Roxbury,Boston,Massachusetts,United States,Entire home/apt,95,10
998,21403195,2014-12-26,Very good experiance had a comfortable stay. V...,NR LGA/JFK & City Studio W/Bathroom,Jackson Heights,New York City,New York,United States,Private room,75,357
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,New York City,New York,United States,Private room,110,329

In [239]:
review["City"]

0             London
1          Amsterdam
2      New York City
3             Madrid
4             Athens
           ...
995            Paris
996      Los Angeles
997           Boston
998    New York City
999    New York City
Name: City, Length: 1000, dtype: object

In [308]:
##mask = review["City"]== 'London'

In [309]:
##review[mask]

In [252]:
mask = review["Room Type"] == 'Private room'
mask

0      False
1       True
2       True
3      False
4      False
       ...
995     True
996    False
997    False
998     True
999     True
Name: Room Type, Length: 1000, dtype: bool

In [253]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,London,North Holland,The Netherlands,Private room,80,10
2,21705849,2014-11-27,I stayed for 4night.She gave us a lot of snuck...,"PRIVATE Room in Spacious, Quiet Apt",Harlem,London,New York,United States,Private room,57,268
5,11372151,2014-11-19,We spent four days at Shane's place. The locat...,Great Light-filled Alberta Arts Rm,King,London,Oregon,United States,Private room,55,121
7,10787310,2013-06-02,Carolines room is perfectly located to discove...,Private room - Central London,Westminster,London,England,United Kingdom,Private room,60,351
8,37085487,2014-06-27,We had a great stay in Tyler's apartment. The ...,Privacy + Free Beer,Marigny,London,Louisiana,United States,Private room,79,330
...,...,...,...,...,...,...,...,...,...,...,...
985,29498170,2013-12-17,The neighborhood was pretty central and my fri...,Great Room at the Gran Via,Palacio,London,Comunidad de Madrid,Spain,Private room,30,338
989,48665633,2012-11-19,Very nice place in a nice neighborhood. Not fa...,North Austin garden haven,78753,London,Texas,United States,Private room,65,364
995,44498863,2012-08-30,I loved staying here during my time in Paris. ...,A typical parisian flat,Buttes-Montmartre,London,le-de-France,France,Private room,35,329
998,21403195,2014-12-26,Very good experiance had a comfortable stay. V...,NR LGA/JFK & City Studio W/Bathroom,Jackson Heights,London,New York,United States,Private room,75,357
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [254]:
type(review[mask])

pandas.core.frame.DataFrame

In [264]:
not_private = review["Room Type"] != "Private room"
not_private

0       True
1      False
2      False
3       True
4       True
       ...
995    False
996     True
997     True
998    False
999    False
Name: Room Type, Length: 1000, dtype: bool

In [265]:
review[not_private]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
3,41133812,2012-05-08,The apartment was situated on the first floor ...,Bonito estudio en pleno centro,Universidad,London,Comunidad de Madrid,Spain,Entire home/apt,38,274
4,7465026,2013-08-16,"Even though it was only for one night, we had ...",Acropolis Apartment brand new,,London,Attica,Greece,Entire home/apt,62,281
6,20417380,2013-11-07,Wonderful experience. We loved staying in the ...,LARGE HOME FOR GROUP ACCOMMODATION,Stonnington,London,Victoria,Australia,Entire home/apt,248,239
9,15542291,2013-12-28,"What a wonderful location, right in the heart ...",Athens Acropolis /B 'Luxury 2,-,London,Attica,Greece,Entire home/apt,37,329
...,...,...,...,...,...,...,...,...,...,...,...
992,13423090,2014-12-25,Ca' di paolo is a cozy apartment in a great lo...,ca' di paolo,Castello,London,Veneto,Italy,Entire home/apt,99,303
993,27392171,2012-03-07,What a great place to stay! In the heart of Ma...,Charming Studio - Heart of Marais,Temple,London,le-de-France,France,Entire home/apt,95,284
994,28605533,2014-09-24,We had a wonderful stay at this apartment. Alt...,sunny and cosy,Brunnenstr. Sd,London,Berlin,Germany,Entire home/apt,62,6
996,30544438,2013-02-28,Highly recommend this as a place to stay if yo...,The Venice Roost on Abbot Kinney,Venice,London,California,United States,Entire home/apt,191,309
997,46642535,2014-08-30,John was a great host. I came in on a red eye...,Top Floor Renovated 1 BR / 1BA,West Roxbury,London,Massachusetts,United States,Entire home/apt,95,10

In [267]:
mask1 = review["Room Price"] > 60

In [268]:
mask2 = review["Room Price"] < 100

In [269]:
mask = mask1 & mask2

In [270]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,London,North Holland,The Netherlands,Private room,80,10
4,7465026,2013-08-16,"Even though it was only for one night, we had ...",Acropolis Apartment brand new,,London,Attica,Greece,Entire home/apt,62,281
8,37085487,2014-06-27,We had a great stay in Tyler's apartment. The ...,Privacy + Free Beer,Marigny,London,Louisiana,United States,Private room,79,330
17,7568387,2013-02-01,Kristina and Ekaterine were lovley hosts. They...,Hollywood Furnished Private Bedroom,Hollywood,London,California,United States,Private room,99,244
20,38360407,2013-12-31,Nice contact. Very friendly and supportive. Th...,Curved wall Studio ST4 with Kitchen,Tower Hamlets,London,England,United Kingdom,Entire home/apt,85,344
...,...,...,...,...,...,...,...,...,...,...,...
992,13423090,2014-12-25,Ca' di paolo is a cozy apartment in a great lo...,ca' di paolo,Castello,London,Veneto,Italy,Entire home/apt,99,303
993,27392171,2012-03-07,What a great place to stay! In the heart of Ma...,Charming Studio - Heart of Marais,Temple,London,le-de-France,France,Entire home/apt,95,284
994,28605533,2014-09-24,We had a wonderful stay at this apartment. Alt...,sunny and cosy,Brunnenstr. Sd,London,Berlin,Germany,Entire home/apt,62,6
997,46642535,2014-08-30,John was a great host. I came in on a red eye...,Top Floor Renovated 1 BR / 1BA,West Roxbury,London,Massachusetts,United States,Entire home/apt,95,10
998,21403195,2014-12-26,Very good experiance had a comfortable stay. V...,NR LGA/JFK & City Studio W/Bathroom,Jackson Heights,London,New York,United States,Private room,75,357

### &

In [275]:
mask = (review["State"] == "California") & (review["Room Type"] == "Private room")

In [276]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
17,7568387,2013-02-01,Kristina and Ekaterine were lovley hosts. They...,Hollywood Furnished Private Bedroom,Hollywood,London,California,United States,Private room,99,244
22,33973256,2013-03-30,Pros: Parking inside property. Convenient Loca...,Private room4 historical house,Harvard Heights,London,California,United States,Private room,46,357
32,16153533,2012-06-12,Good location. Nice house. Sunny and comfort...,Guest Room - Javier Azul,Mission,London,California,United States,Private room,65,335
36,35333712,2012-07-27,"Aj is really nice , and kind guy.. It was good...",Modern & Comfy in LA!!!,Mid-Wilshire,London,California,United States,Private room,94,254
50,17543666,2012-01-03,"This is a great place to stay, it is a lovely ...",Tranquil 2BR Suite w/ Private Bath,Western Addition,London,California,United States,Private room,240,338
66,40805030,2012-10-11,Kristelle was very kind and super welcoming! I...,Great room in NOHO Arts district!,North Hollywood,London,California,United States,Private room,57,256
74,7911249,2014-01-17,I contacted Laurie on a Saturday evening at th...,CUTE~Cozy Venice Cottage!~close2LAX,Venice,London,California,United States,Private room,100,335
108,24086047,2012-06-24,Rachel's house was very convenient and I had n...,"Private studio, Oakland: Montclair",Merriwood,London,California,United States,Private room,88,263
109,10945962,2013-08-04,Probably the most comfortable bed in my life (...,Stunning 1904 Colonial in Oakland,Oak Center,London,California,United States,Private room,59,269
161,38960229,2012-04-21,Ricky was responsive and welcoming. You get wh...,The Utah Inn,South of Market,London,California,United States,Private room,65,132
178,30480072,2012-03-25,"Camille is a happy, busy, engaging woman who w...","Studio Near Pasadena, San Marino...",East San Gabriel,London,California,United States,Private room,62,322
181,32219958,2013-09-24,"Great room! Private, clean, adorable & afforda...",PRIVATE Entrance Bedroom / Bath LA,Encino,London,California,United States,Private room,80,306
204,43365494,2012-07-10,The place was just as advertised; good locatio...,Stay in the heart of North Beach!,North Beach,London,California,United States,Private room,89,312
205,23442390,2012-09-23,Sonia and Jason made us feel at home from the ...,Beautiful Home near Ocean & GG Park,Outer Sunset,London,California,United States,Private room,97,365
215,36873068,2014-06-13,We are very very pleased with our stay with To...,Perfect beach getaway!,Santa Monica,London,California,United States,Private room,100,168
236,45372449,2012-09-12,Our stay in the room was pleasant and it fit t...,Starlight Room With 2 Queen Beds,Pico Rivera,London,California,United States,Private room,59,350
258,31118183,2014-09-04,Mike was a gracious host and he was very accom...,Pvt Room gated parking in NOHO,Valley Village,London,California,United States,Private room,55,258
290,26877442,2014-01-16,Omar and Jean-Marie are one of the most gracio...,Cozy double in Mission Victorian,Mission,London,California,United States,Private room,120,125
305,10926136,2012-08-14,My friend and I stayed with Lisa & joe at the ...,Rm#1-PEACEFUL PARADISE by Sea,Venice,London,California,United States,Private room,100,340
331,25985434,2013-07-23,Zack and Mel were everything you could want in...,"Big House, Hip Scene, Chill Ppl 1",Silver Lake,London,California,United States,Private room,87,109
390,37317051,2012-08-07,Alex and Justin were extremely sweet and recom...,Mission bedroom in Garden Apartment,Mission,London,California,United States,Private room,95,331
394,47350434,2013-07-10,"Nice, clean place in good style. Very friendly...",Dolores Park View (2 rooms),Mission,London,California,United States,Private room,140,257
416,2846722,2013-01-06,Finding an apartment in San Francisco is diffi...,5-Star Nob Hill Bright Heart of SF,Nob Hill,London,California,United States,Private room,129,29
430,40152723,2013-10-12,Lara is a great host and the place was as desc...,Treehouse Futon/Loft By The Beach!,Long Beach,London,California,United States,Private room,58,365
445,31668856,2014-06-05,"Wow, where to begin?...My visit with Sabine wa...",Hollywood Hills Sanctuary,Hollywood Hills,London,California,United States,Private room,88,340
463,39354514,2013-04-20,Vivian is great. We like her and her place. Th...,Cozy Giants Room @Golden Gate Park,Inner Richmond,London,California,United States,Private room,115,354
497,11474019,2013-06-06,Sandy was so welcoming opening her house to me...,Eagle Rock Guest Room with a View,Eagle Rock,London,California,United States,Private room,80,356
499,20742050,2013-09-18,Listing was accurate and more than expected. C...,Private Sunny Room in Artist's Apt,Studio City,London,California,United States,Private room,70,322
513,19138611,2014-04-29,Wonderful house and amazing host! John's house...,Hollywood Private Room Queen Bed,Hollywood,London,California,United States,Private room,85,272
571,1255563,2013-06-13,Nichola has a wonderful home in the Rancho dis...,Burbank - Nr Disney NBC Warner NYFA,Burbank,London,California,United States,Private room,95,365
591,38844338,2014-09-27,Abhay's home was lovely and comfortable and in...,Master suite in Charming Edwardian,Glen Park,London,California,United States,Private room,105,219
594,35752320,2012-02-18,It was a great stay by David. He is very frien...,"Modern, Contemporary Apt.",Santa Monica,London,California,United States,Private room,90,359
609,16483404,2013-11-23,Beth was away for the weekend but her husband ...,Peaceful room in Glen Park (SF),Outer Mission,London,California,United States,Private room,65,120
612,29049258,2014-04-22,Spacious room and friendly host.,Urban Tranquility in Ingleside,Ocean View,London,California,United States,Private room,100,324
645,14169337,2013-03-12,I had such an AMAZING stay. Glamping was at it...,Rm#4-PEACEFUL PARADISE by Sea,Venice,London,California,United States,Private room,80,360
682,6649468,2013-01-08,"We weren't around much, but we slept well and ...",Vintage Sunny Private Room + Bath,Potrero Hill,London,California,United States,Private room,80,283
707,13881760,2014-11-15,Sue is a great host! We really felt welcome an...,Sue's Place,Bernal Heights,London,California,United States,Private room,135,339
708,52109736,2013-01-05,"Very very cozy,clean,quiet place! Nice,kind an...",Cozy-Quite Single-Family Room,Excelsior,London,California,United States,Private room,80,361
747,11656316,2013-05-03,We loved staying at Natasha's and Kai's gourge...,Traditional Mission Victorian,Mission,London,California,United States,Private room,110,330
774,33501216,2012-09-22,Sandra was very welcoming and helpful with all...,Escape to & Relax 4 blocks to Beach,Playa del Rey,London,California,United States,Private room,95,127
818,897662,2013-09-19,It was a pleasure to stay at this very beautif...,L.A. Lifestyle--like you live here,Mid-City,London,California,United States,Private room,100,306
829,26694986,2014-09-03,The area is amazing and safe and Tracy's place...,Tracy&Ava's Angel room,Venice,London,California,United States,Private room,92,344
889,965480,2014-05-17,A non-expensive option in Santa Monica. The ro...,Master BR in Santa Monica Townhome,Santa Monica,London,California,United States,Private room,74,214
898,32425960,2012-04-02,Adrian has a bright home and equally bright pe...,Double Room in the Castro,Castro/Upper Market,London,California,United States,Private room,125,178
909,17600876,2012-12-04,My travels plans change and therefore I needed...,Santa Monica / easy access to LA 2,Santa Monica,London,California,United States,Private room,79,319
928,38052964,2012-10-18,"so, this is what it says in the listing: 'We h...",Serene Garden Room by the Beach!!!,Santa Monica,London,California,United States,Private room,80,82
940,37536009,2014-09-23,"Kathryn was a lovely host, and she answered al...",stay in the heart of santa monica,Santa Monica,London,California,United States,Private room,89,361
958,5009965,2013-01-28,Elke's place was just wonderful. The moment I ...,Cozy & Sweet Studio - Private,Noe Valley,London,California,United States,Private room,95,244

### |

In [279]:
mask = (review["Room Type"] == "Private room") | (review["Room Price"] >200)

In [280]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,London,North Holland,The Netherlands,Private room,80,10
2,21705849,2014-11-27,I stayed for 4night.She gave us a lot of snuck...,"PRIVATE Room in Spacious, Quiet Apt",Harlem,London,New York,United States,Private room,57,268
5,11372151,2014-11-19,We spent four days at Shane's place. The locat...,Great Light-filled Alberta Arts Rm,King,London,Oregon,United States,Private room,55,121
6,20417380,2013-11-07,Wonderful experience. We loved staying in the ...,LARGE HOME FOR GROUP ACCOMMODATION,Stonnington,London,Victoria,Australia,Entire home/apt,248,239
7,10787310,2013-06-02,Carolines room is perfectly located to discove...,Private room - Central London,Westminster,London,England,United Kingdom,Private room,60,351
...,...,...,...,...,...,...,...,...,...,...,...
985,29498170,2013-12-17,The neighborhood was pretty central and my fri...,Great Room at the Gran Via,Palacio,London,Comunidad de Madrid,Spain,Private room,30,338
989,48665633,2012-11-19,Very nice place in a nice neighborhood. Not fa...,North Austin garden haven,78753,London,Texas,United States,Private room,65,364
995,44498863,2012-08-30,I loved staying here during my time in Paris. ...,A typical parisian flat,Buttes-Montmartre,London,le-de-France,France,Private room,35,329
998,21403195,2014-12-26,Very good experiance had a comfortable stay. V...,NR LGA/JFK & City Studio W/Bathroom,Jackson Heights,London,New York,United States,Private room,75,357
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

### isin()

In [310]:
mask =  (review["City"] == "Madrid") | (review["City"] == "London") | (review["City"] == "Amsterdam") | (review["City"] == "Paris")

In [311]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
658,23914491,2012-04-06,It was my first ever time using airbnb to book...,appt 5 1/2 spacieux/luxueux,Mercier-Hochelaga-Maisonneuve,London,Quebec,Canada,Entire home/apt,150,363
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
660,24710430,2014-05-28,We found the accommodations as described. The...,Design!Canal and San Marco's view,Cannaregio,London,Veneto,Italy,Entire home/apt,133,310
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
...,...,...,...,...,...,...,...,...,...,...,...
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
328,7937600,2013-01-04,"the host was so friendly, generous and kind. m...",East Dulwich single - garden view,Southwark,London,England,United Kingdom,Private room,30,356
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [312]:
mask1 =  review["City"].isin(["Madrid", "London", "Amsterdam", "Paris"])

In [313]:
mask1

0      True
658    True
659    True
660    True
661    True
       ...
339    True
340    True
341    True
328    True
999    True
Name: City, Length: 1000, dtype: bool

In [307]:
review[mask1]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
658,23914491,2012-04-06,It was my first ever time using airbnb to book...,appt 5 1/2 spacieux/luxueux,Mercier-Hochelaga-Maisonneuve,London,Quebec,Canada,Entire home/apt,150,363
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
660,24710430,2014-05-28,We found the accommodations as described. The...,Design!Canal and San Marco's view,Cannaregio,London,Veneto,Italy,Entire home/apt,133,310
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
...,...,...,...,...,...,...,...,...,...,...,...
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
328,7937600,2013-01-04,"the host was so friendly, generous and kind. m...",East Dulwich single - garden view,Southwark,London,England,United Kingdom,Private room,30,356
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

### between()

In [297]:
mask = review["Room Price"].between(80,100)

In [298]:
mask

0       True
1       True
2      False
3      False
4      False
       ...
995    False
996    False
997     True
998    False
999    False
Name: Room Price, Length: 1000, dtype: bool

In [299]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,London,North Holland,The Netherlands,Private room,80,10
17,7568387,2013-02-01,Kristina and Ekaterine were lovley hosts. They...,Hollywood Furnished Private Bedroom,Hollywood,London,California,United States,Private room,99,244
20,38360407,2013-12-31,Nice contact. Very friendly and supportive. Th...,Curved wall Studio ST4 with Kitchen,Tower Hamlets,London,England,United Kingdom,Entire home/apt,85,344
23,40294978,2012-09-25,"The room was nice, breakfast was great and Joh...",Dupont Private Room Meridian Manor,"Dupont Circle, Connecticut Avenue/K Street",London,D.C.,"District of Columbia, United States",Private room,99,361
...,...,...,...,...,...,...,...,...,...,...,...
986,38974125,2014-11-29,The host canceled this reservation 2 days befo...,Cozy and Heart of Downtown MTL,Ville-Marie,London,Quebec,Canada,Entire home/apt,80,137
991,35585745,2012-12-30,Andrea was good in communication and flexible ...,Designer Inner City Escape,Sydney,London,New South Wales,Australia,Entire home/apt,98,319
992,13423090,2014-12-25,Ca' di paolo is a cozy apartment in a great lo...,ca' di paolo,Castello,London,Veneto,Italy,Entire home/apt,99,303
993,27392171,2012-03-07,What a great place to stay! In the heart of Ma...,Charming Studio - Heart of Marais,Temple,London,le-de-France,France,Entire home/apt,95,284
997,46642535,2014-08-30,John was a great host. I came in on a red eye...,Top Floor Renovated 1 BR / 1BA,West Roxbury,London,Massachusetts,United States,Entire home/apt,95,10

In [300]:
mask = review["Review Date"].between("2013-01-01", "2014-01-01")

In [301]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
1,25329416,2013-11-03,Me and my friends had such a nice time at Dott...,Quiet Pink Studio in the PIJP area,De Pijp - Rivierenbuurt,London,North Holland,The Netherlands,Private room,80,10
4,7465026,2013-08-16,"Even though it was only for one night, we had ...",Acropolis Apartment brand new,,London,Attica,Greece,Entire home/apt,62,281
6,20417380,2013-11-07,Wonderful experience. We loved staying in the ...,LARGE HOME FOR GROUP ACCOMMODATION,Stonnington,London,Victoria,Australia,Entire home/apt,248,239
7,10787310,2013-06-02,Carolines room is perfectly located to discove...,Private room - Central London,Westminster,London,England,United Kingdom,Private room,60,351
9,15542291,2013-12-28,"What a wonderful location, right in the heart ...",Athens Acropolis /B 'Luxury 2,-,London,Attica,Greece,Entire home/apt,37,329
...,...,...,...,...,...,...,...,...,...,...,...
983,2018617,2013-12-22,Ysaira and Jose are the sweetest people. They ...,Bronx Room Near Yankees & Harlem,Morris Heights,London,New York,United States,Private room,40,302
985,29498170,2013-12-17,The neighborhood was pretty central and my fri...,Great Room at the Gran Via,Palacio,London,Comunidad de Madrid,Spain,Private room,30,338
987,21950610,2013-06-10,Arne's studio was the perfect size and locatio...,Stylish app. in center of Amsterdam,Centrum-Oost,London,North Holland,The Netherlands,Entire home/apt,115,255
996,30544438,2013-02-28,Highly recommend this as a place to stay if yo...,The Venice Roost on Abbot Kinney,Venice,London,California,United States,Entire home/apt,191,309
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

### duplicated()

In [303]:
review.sort_values("City", inplace= True)

In [304]:
review

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
658,23914491,2012-04-06,It was my first ever time using airbnb to book...,appt 5 1/2 spacieux/luxueux,Mercier-Hochelaga-Maisonneuve,London,Quebec,Canada,Entire home/apt,150,363
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
660,24710430,2014-05-28,We found the accommodations as described. The...,Design!Canal and San Marco's view,Cannaregio,London,Veneto,Italy,Entire home/apt,133,310
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
...,...,...,...,...,...,...,...,...,...,...,...
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
328,7937600,2013-01-04,"the host was so friendly, generous and kind. m...",East Dulwich single - garden view,Southwark,London,England,United Kingdom,Private room,30,356
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [315]:
review["City"].duplicated() ## if you see first time your will get False, if you see more time same value it will return True

0      False
658     True
659     True
660     True
661     True
       ...
339     True
340     True
341     True
328     True
999     True
Name: City, Length: 1000, dtype: bool

In [316]:
mask = ~review["City"].duplicated() ## Change the duplicated method reverses..

In [ ]:
review[mask]

### drop_duplicates

In [319]:
review

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
658,23914491,2012-04-06,It was my first ever time using airbnb to book...,appt 5 1/2 spacieux/luxueux,Mercier-Hochelaga-Maisonneuve,London,Quebec,Canada,Entire home/apt,150,363
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
660,24710430,2014-05-28,We found the accommodations as described. The...,Design!Canal and San Marco's view,Cannaregio,London,Veneto,Italy,Entire home/apt,133,310
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
...,...,...,...,...,...,...,...,...,...,...,...
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
328,7937600,2013-01-04,"the host was so friendly, generous and kind. m...",East Dulwich single - garden view,Southwark,London,England,United Kingdom,Private room,30,356
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [322]:
mask = review.drop_duplicates() ## If you have same data, delete them

In [324]:
mask

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
658,23914491,2012-04-06,It was my first ever time using airbnb to book...,appt 5 1/2 spacieux/luxueux,Mercier-Hochelaga-Maisonneuve,London,Quebec,Canada,Entire home/apt,150,363
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
660,24710430,2014-05-28,We found the accommodations as described. The...,Design!Canal and San Marco's view,Cannaregio,London,Veneto,Italy,Entire home/apt,133,310
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
...,...,...,...,...,...,...,...,...,...,...,...
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
328,7937600,2013-01-04,"the host was so friendly, generous and kind. m...",East Dulwich single - garden view,Southwark,London,England,United Kingdom,Private room,30,356
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [334]:
x = len(review.drop_duplicates(subset = ["City"])) ## only take london

In [335]:
x

1

In [340]:
y = len(review.drop_duplicates(subset = ["Room Type"])) #we have different unique type of rooms in london

In [341]:
y

3

### unique, nunique

In [342]:
review["City"].unique() ## Unique is london because we just analyze london.

array(['London'], dtype=object)

In [343]:
review["City"] ## bring all london value because of we use before the code and we did perm.

0      London
658    London
659    London
660    London
661    London
        ...
339    London
340    London
341    London
328    London
999    London
Name: City, Length: 1000, dtype: object

In [344]:
len(review["City"].unique())

1

In [345]:
review["Country"]

0      United Kingdom
658            Canada
659     United States
660             Italy
661     United States
            ...
339     United States
340     United States
341     United States
328    United Kingdom
999     United States
Name: Country, Length: 1000, dtype: object

### upper(), lower(), title(), len()

In [346]:
review["Country"].str.upper()

0      UNITED KINGDOM
658            CANADA
659     UNITED STATES
660             ITALY
661     UNITED STATES
            ...
339     UNITED STATES
340     UNITED STATES
341     UNITED STATES
328    UNITED KINGDOM
999     UNITED STATES
Name: Country, Length: 1000, dtype: object

In [347]:
review["Country"].str.lower()

0      united kingdom
658            canada
659     united states
660             italy
661     united states
            ...
339     united states
340     united states
341     united states
328    united kingdom
999     united states
Name: Country, Length: 1000, dtype: object

In [348]:
review["Country"].str.title()

0      United Kingdom
658            Canada
659     United States
660             Italy
661     United States
            ...
339     United States
340     United States
341     United States
328    United Kingdom
999     United States
Name: Country, Length: 1000, dtype: object

In [350]:
review["Country"].str.len() ## we know here values length...

0      14
658     6
659    13
660     5
661    13
       ..
339    13
340    13
341    13
328    14
999    13
Name: Country, Length: 1000, dtype: int64

### replace()

In [352]:
review["Room Type"].str.replace('room','Room')

0      Entire home/apt
658    Entire home/apt
659    Entire home/apt
660    Entire home/apt
661    Entire home/apt
            ...
339    Entire home/apt
340    Entire home/apt
341    Entire home/apt
328       Private Room
999       Private Room
Name: Room Type, Length: 1000, dtype: object

In [353]:
review["Room Type"].str.replace('home','Home')

0      Entire Home/apt
658    Entire Home/apt
659    Entire Home/apt
660    Entire Home/apt
661    Entire Home/apt
            ...
339    Entire Home/apt
340    Entire Home/apt
341    Entire Home/apt
328       Private room
999       Private room
Name: Room Type, Length: 1000, dtype: object

In [360]:
mask1=review["Country"].str.upper().str.contains('UNITED')
review[mask1]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
664,28026267,2014-08-23,Anna made us feel welcome and provided some su...,Boutique Alcoves Studio by Union Sq,Greenwich Village,London,New York,United States,Entire home/apt,149,243
665,46219138,2012-04-25,"we had a great, but short stay in boston! the ...",Spacious Room in Boston,Jamaica Plain,London,Massachusetts,United States,Private room,84,176
...,...,...,...,...,...,...,...,...,...,...,...
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
328,7937600,2013-01-04,"the host was so friendly, generous and kind. m...",East Dulwich single - garden view,Southwark,London,England,United Kingdom,Private room,30,356
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [357]:
mask = review["Country"].str.upper().str.startswith('UN')

In [358]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
0,4055629,2012-10-06,Very nice accommodation in an aesthetically pl...,Nottinghill Portobello Artist Flat,Kensington and Chelsea,London,England,United Kingdom,Entire home/apt,100,338
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
664,28026267,2014-08-23,Anna made us feel welcome and provided some su...,Boutique Alcoves Studio by Union Sq,Greenwich Village,London,New York,United States,Entire home/apt,149,243
665,46219138,2012-04-25,"we had a great, but short stay in boston! the ...",Spacious Room in Boston,Jamaica Plain,London,Massachusetts,United States,Private room,84,176
...,...,...,...,...,...,...,...,...,...,...,...
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
328,7937600,2013-01-04,"the host was so friendly, generous and kind. m...",East Dulwich single - garden view,Southwark,London,England,United Kingdom,Private room,30,356
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [361]:
mask = review["Country"].str.lower().str.endswith('s')

In [362]:
review[mask]

,Review ID,Review Date,Review Content,Listing Title,Neighbourhood,City,State,Country,Room Type,Room Price,Room Availability
659,30148314,2013-07-23,Jenifer was welcoming and accommodating. I arr...,Spacious SF Getaway Near The Ocean,Parkside,London,California,United States,Entire home/apt,165,356
661,27094762,2013-09-08,Great stay! Everything went smoothly. Thanks!,Lovely House in heart of Silverlake,Silver Lake,London,California,United States,Entire home/apt,125,235
664,28026267,2014-08-23,Anna made us feel welcome and provided some su...,Boutique Alcoves Studio by Union Sq,Greenwich Village,London,New York,United States,Entire home/apt,149,243
665,46219138,2012-04-25,"we had a great, but short stay in boston! the ...",Spacious Room in Boston,Jamaica Plain,London,Massachusetts,United States,Private room,84,176
668,42683656,2014-03-11,"Angela was a very welcoming host, we communica...",Perfect Beach Getaway Close to All!,Redondo Beach,London,California,United States,Entire home/apt,350,254
...,...,...,...,...,...,...,...,...,...,...,...
338,22260942,2012-01-31,What a place! Much bigger in real life than in...,Zen Casita Hideaway,Seventh Ward,London,Louisiana,United States,Entire home/apt,100,170
339,7318998,2012-10-07,"Rob was a great host, it was a pleasure meetin...",Beautiful studio in Manhattan,Hell's Kitchen,London,New York,United States,Entire home/apt,200,0
340,34515406,2013-02-25,This is a beautiful place in a great location....,Luxury Chicago Loft,Lake View,London,Illinois,United States,Entire home/apt,165,299
341,39989690,2012-05-10,PROS: *spacious for our party of 6 adults and ...,Top floor upscale 2BD/2BA condo A,Bridgeton,London,Oregon,United States,Entire home/apt,150,339
999,38944752,2013-10-15,Thank you for the wonderful stay! It was a c...,15 Minutes from Manhattan,Woodside,London,New York,United States,Private room,110,329

In [363]:
review["Country"].str.strip()

0      United Kingdom
658            Canada
659     United States
660             Italy
661     United States
            ...
339     United States
340     United States
341     United States
328    United Kingdom
999     United States
Name: Country, Length: 1000, dtype: object

In [368]:
print("     I am Mustafa       .")
print("     I am Mustafa       .".lstrip())

     I am Mustafa       .
I am Mustafa       .

### split

In [370]:
"My name is Mustafa".split(' ')

['My', 'name', 'is', 'Mustafa']

In [373]:
review["Country"].str.split(" ").str.get(0) ## get zero index True

0      United
658    Canada
659    United
660     Italy
661    United
        ...
339    United
340    United
341    United
328    United
999    United
Name: Country, Length: 1000, dtype: object

In [376]:
review["Country"].str.split(" ", expand = True ) ## It will return like dataFrame...

          0        1     2     3     4
0    United  Kingdom  None  None  None
658  Canada     None  None  None  None
659  United   States  None  None  None
660   Italy     None  None  None  None
661  United   States  None  None  None
..      ...      ...   ...   ...   ...
339  United   States  None  None  None
340  United   States  None  None  None
341  United   States  None  None  None
328  United  Kingdom  None  None  None
999  United   States  None  None  None

[1000 rows x 5 columns]